puts ""
x = gets.to_i
case x
when 1
  puts "  Іде солдат з батьком вулицею, 
  а на зустріч їм чотири дівчини в міні-спідницях. 
  Солдат зупинився як вкопаний і уважно дивиться на дівочі ноги. 
  Ті вже й пройшли, а він усе дивиться їм услід. 
  А потім похитав головою і каже батькові: 
  а одна з них ішла не в ногу."
when 2 
  puts "  Путіна після смерті відправили в пекло.
  Але, оскільки в нього була хороша поведінка, 
  йому дозволили спуститися у Москву.
  Він спустився, прогулявся, зайшов у московський бар,
  замовив чарку горілки і питає у бармена:
  – Крим наш?
  – Так, Крим наш, – відповів бармен.
  – А Донбас наш?
  – Так, Донбас наш.
  – Ну а Київ теж наш?
  – Звичайно, теж наш.
  Путін з задоволенням випив чарку і потім каже:
  – А скільки я маю заплатити?
  – 100 гривень."
when 3
  puts "  – Іване, ти памятаєш що було 35 років тому?
  – Звісно ж! Чорнобиль вибухнув!
  – Дурнику, ми одружилися!
  – Так, біда не ходить одна…"
when 4
  puts "  – Алло, це лінія допомоги алкоголікам?
  – Так.
  – Підкажіть як зробити мохіто!"
when 5
  puts "  Зранку роблю зарядку нахиляюсь долонями до підлоги… 
  Прокидається жінка й каже: 
  «Не треба поклонів. Можна просто 
  Доброго ранку, принцесо!»"
when 6
  puts "  - Добрий день. Хочете поговорити про Бога? 
  - Ні. 
  - А якщо я буду наполягати? 
  - Доведеться вам про моє небажання передати йому особисто."
when 7
  puts "  Як вступити в вашу організацію?
  - Треба вбити 8 москалів і одного кота...
  - А кота за що?
  - Ви прийняті!"
when 8
  puts "  Вуйко бере сокиру і з рішучим виглядом йде з хати. 
  Жінка питає
  -Ти куди, Миколо?
  -Та піду зрубаю березу коло хати
  -Ой лишечко, та навіщо ж?!
  -Та не дай Бог, знову прийдуть москалі,скажуть: Істінно русскій пєйзаж!.."
when 9
  puts "14 лютого. У крамниці:
  - Дайте мені, будь ласка, ту червону плюшеву дупу.
  - Чоловік, це не дупа, а серце!
  - Знаєте, я 20 років кардіохірургом працюю. Дайте мені ту червону плюшеву дупу."
end